# YOLO-MobileOne 500K model configuration
# Based on MobileOne architecture with YOLO detection head
# Target: ~500K parameters similar to yoloface-500k
# MobileOne features: reparameterization, multi-branch training, single-branch inference

nc: 1 # number of classes (head, front, back)
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [4, 6, 7, 10, 11, 15]
  - [16, 24, 33, 25, 26, 41]
  - [47, 60, 83, 97, 141, 149]

backbone:
  # [from, number, module, args]
  # MobileOne backbone with reparameterization - optimized for ~500K params
  [
    [-1, 1, Conv, [8, 3, 2]],  # 0  [batch, 8, size/2, size/2]
    [-1, 1, MobileOneBlock, [8, 3, 1, 1]], # 1 MobileOne block: [c1, c2, k, s, num_conv_branches]
    
    [-1, 1, Conv, [16, 1, 1]], # 2
    [-1, 1, MobileOneBlock, [16, 3, 1, 1]], # 3 
    [-1, 1, MobileOneBlock, [16, 3, 1, 1]], # 4
    
    [-1, 1, Conv, [24, 1, 1]], # 5
    [-1, 1, MobileOneBlock, [24, 3, 2, 1]], # 6 downsample size/4
    [-1, 1, MobileOneBlock, [24, 3, 1, 1]], # 7 single block
    
    [-1, 1, Conv, [48, 1, 1]], # 8
    [-1, 1, MobileOneBlock, [48, 3, 2, 1]], # 9 downsample size/8
    [-1, 1, MobileOneBlock, [48, 3, 1, 1]], # 10 single block
    
    [-1, 1, Conv, [96, 1, 1]], # 11
    [-1, 1, MobileOneBlock, [96, 3, 2, 1]], # 12 downsample size/16
    [-1, 1, MobileOneBlock, [96, 3, 1, 1]], # 13
  ]

head: [
    [-1, 1, Conv, [48, 1, 1]], # 14
    # [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 15
    [[-1, 12], 1, Concat, [1]], # 15 [batch, 96, size/16, size/16]

    [-1, 1, Conv, [24, 1, 1]], # 16
    [-1, 1, MobileOneBlock, [24, 3, 1, 1]], # 17
    [-1, 1, Conv, [18, 1, 1]], # 18 [batch, 24, size/16, size/16]
    
    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 19
    [[-1, 9], 1, Concat, [1]],  # 20 [batch, 72, size/8, size/8]
    [-1, 1, Conv, [18, 1, 1]], # 21
    [-1, 1, MobileOneBlock, [18, 3, 1, 1]], # 22
    [-1, 1, Conv, [18, 1, 1]], # 23 [batch, 24, size/8, size/8]

    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 24
    [[-1, 6], 1, Concat, [1]],  # 25 [batch, 42, size/4, size/4]
    [-1, 1, Conv, [16, 1, 1]], # 26
    [-1, 1, MobileOneBlock, [16, 3, 1, 1]], # 27
    [-1, 1, Conv, [18, 1, 1]], # 28 [batch, 24, size/4, size/4]

    [[28, 23, 18], 1, Detect, [nc, anchors]], # 29 Detect(P3, P4, P5)
]