# YOLOv3 Ghost-based lightweight model with <120k parameters
# Based on GhostNet architecture for efficient feature extraction
# Optimized for proper scale hierarchy: 1/16, 1/8, 1/4

nc: 1  # number of classes (head, front, back)
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# Anchors optimized for face detection
anchors:
  - [4, 6, 7, 10, 11, 15]
  - [16, 24, 33, 25, 26, 41]
  - [47, 60, 83, 97, 141, 149]

# Ghost-based backbone with proper scale hierarchy
backbone:
  # [from, number, module, args]
  # args: out_channels, kernel_size, stride
  [
    [-1, 1, GhostConv, [16, 3, 2]],  # 0  [batch, 16, size/2, size/2]
    [-1, 1, GhostBottleneck, [16, 3, 1]], # 1 - Ghost bottleneck
    
    [-1, 1, GhostConv, [32, 3, 2]], # 2 - Downsample to size/4
    [-1, 1, GhostBottleneck, [32, 3, 1]], # 3 - Standard Ghost block
    [-1, 1, GhostConv, [32, 1, 1]], # 4 - Ghost feature enhancement
    
    [-1, 1, GhostConv, [64, 3, 2]], # 5 - Channel expansion size/8
    [-1, 1, GhostBottleneck, [64, 3, 1]], # 6  
    [-1, 1, GhostBottleneck, [64, 3, 1]], # 7 - Additional depth
    
    [-1, 1, GhostConv, [96, 3, 2]], # 8 - Channel expansion size/16
    [-1, 1, GhostBottleneck, [96, 3, 1]], # 9
    [-1, 1, GhostConv, [96, 1, 1]], # 10 - Final ghost processing
  ]

# Ghost-based detection head with proper feature fusion
head:
  [
    [-1, 1, GhostConv, [64, 1, 1]], # 11 - Ghost feature processing
    [-1, 1, GhostConv, [32, 1, 1]], # 11 - Ghost feature processing
    [[-1, 8], 1, Concat, [1]], # 13 - Concat with layer 6 (128 channels total)
    
    [-1, 1, GhostConv, [18, 1, 1]], # 14 - Final ghost conv
    [-1, 1, Conv, [18, 1, 1]], # 15 - Output layer for size/8
    
    [-3, 1, nn.Upsample, [None, 2, "nearest"]],  # 16 - Upsample to size/8
    [[-1, 5], 1, Concat, [1]],  # 17 - Concat with layer 3 (80 channels total)
    [-1, 1, GhostConv, [18, 1, 1]], # 18 - Final ghost conv
    [-1, 1, Conv, [18, 1, 1]], # 19 - Output layer for size/4
    
    [-3, 1, nn.Upsample, [None, 2, "nearest"]],  # 20 - Upsample to size/4
    [[-1, 2], 1, Concat, [1]],  # 21 - Concat with layer 1 (34 channels total)
    [-1, 1, GhostConv, [18, 1, 1]], # 22 - Final ghost conv
    [-1, 1, Conv, [18, 1, 1]], # 23 - Output layer for size/2
    
    [[23, 19, 15], 1, Detect, [nc, anchors]], # 24 - Detection head (size/2, size/4, size/8)
  ]
