nc: 1 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [4, 6, 7, 10, 11, 15]
  - [16, 24, 33, 25, 26, 41]
  - [47, 60, 83, 97, 141, 149]

backbone:
  # [from, number, module, args]
  # args: out_channels, size, stride
  [
    [-1, 1, Conv, [2, 3, 2]],  # 0  [batch, 8, size/2, size/2]
    [-1, 1, DWConv, [2, 3, 1]], # 1 [320]
    [-1, 1, Conv, [7, 1, 1 ]], # 2  [320]
    [-1, 1, Conv, [24, 1, 1]], # 3 [-1, 1, DWConv, [24, 3, 2]] # 4
    [-1, 1, Conv, [8, 1, 1]], # 4
    [-1, 1, Bottleneck3, [8]], # 5

    [-1, 1, Conv, [32, 1, 1]], # 6  
    [-1, 1, DWConv, [32, 3, 2]], # 7  [160]
    [-1, 1, Conv, [8, 1, 1]], # 8
    [-1, 2, Bottleneck3, [8]], # 9
    
    [-1, 1, Conv, [38, 1, 1]], # 10 
    [-1, 1, DWConv, [38, 3, 2]], # 11 [80]
    [-1, 1, Conv, [16, 1, 1]], # 12
    [-1, 3, Bottleneck3, [16]], # 13

    [-1, 1, Conv, [83, 1, 1]], # 14
    [-1, 1, DWConv, [83, 3, 1]], # 15
    [-1, 1, Conv, [24, 1, 1]], # 16
    [-1, 2, Bottleneck3, [24]], # 17

    [-1, 1, Conv, [115, 1, 1]], # 18    [80]
    [-1, 1, DWConv, [115, 3, 2]], # 19  [80] -> [40]
    [-1, 1, Conv, [40, 1, 1]], # 20
    [-1, 2, Bottleneck3, [40]], # 21 [batch, 40, size/16, size/16]
  ]

head: [
    [-1, 1, Conv, [64, 1, 1]], # 22 [40]
    [[-1, -4], 1, Concat, [1]], # 23  [batch, 224, size/16, size/16]  [40]

    [-1, 1, Conv, [39, 1, 1]], # 24
    [-1, 1, DWConv, [39, 3, 1]], # 25
    [-1, 1, Conv, [33, 1, 1]], # 26
    [-1, 1, Conv, [18, 1, 1]], # 27   [batch, 18, size/8, size/8] -> [40]
    
    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 28   [80]
    [[-1, 11], 1, Concat, [1]],  # 29   [80]  ch = 272
    [-1, 1, Conv, [19, 1, 1]], # 30
    [-1, 1, DWConv, [19, 3, 1]], # 31 
    [-1, 1, Conv, [21, 1, 1]], # 32   
    [-1, 1, Conv, [18, 1, 1]], # 33 [batch, 18, 160, 160] -> [80]

    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 34 [1, 272, 320, 320] -> [160]
    [[-1, 7], 1, Concat, [1]],  # 35  
    [-1, 1, Conv, [12, 1, 1]], # 36   
    [-1, 1, DWConv, [12, 3, 1]], # 37 
    [-1, 1, Conv, [16, 1, 1]], # 38   
    [-1, 1, Conv, [18, 1, 1]], # 39   [batch, 18, 320, 320] -> [160]

    [[39, 33, 27], 1, Detect, [nc, anchors]], 


  ]