nc: 1 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [4, 6, 7, 10, 11, 15]
  - [16, 24, 33, 25, 26, 41]
  - [47, 60, 83, 97, 141, 149]

backbone:
  # [from, number, module, args]
  # args: out_channels, size, stride
  [
    [-1, 1, Conv, [1, 3, 2]],  # 0  [batch, 8, size/2, size/2]
    [-1, 1, DWConv, [1, 3, 1]], # 1 [320]
    [-1, 1, Conv, [6, 1, 1 ]], # 2  [320]
    [-1, 1, Conv, [14, 1, 1]], # 3 [-1, 1, DWConv, [24, 3, 2]] # 4
    [-1, 1, Conv, [4, 1, 1]], # 4
    [-1, 1, Bottleneck3, [4, 30]], # 5

    [-1, 1, Conv, [24, 1, 1]], # 6  
    [-1, 1, DWConv, [24, 3, 2]], # 7  [160]
    [-1, 1, Conv, [7, 1, 1]], # 8
    [-1, 1, Bottleneck3, [7, 26]], # 9
    [-1, 1, Bottleneck3, [7, 34]], # 10
    
    [-1, 1, Conv, [28, 1, 1]], # 11 
    [-1, 1, DWConv, [28, 3, 2]], # 12 [80] 
    [-1, 1, Conv, [9, 1, 1]], # 13
    [-1, 1, Bottleneck3, [9, 60]], # 14
    [-1, 1, Bottleneck3, [9, 71]], # 15
    [-1, 1, Bottleneck3, [9, 76]], # 16

    [-1, 1, Conv, [57, 1, 1]], # 17
    [-1, 1, DWConv, [57, 3, 1]], # 18
    [-1, 1, Conv, [20, 1, 1]], # 19
    [-1, 1, Bottleneck3, [20, 84]], # 20
    [-1, 1, Bottleneck3, [20, 111]], # 21

    [-1, 1, Conv, [86, 1, 1]], # 22    [80]
    [-1, 1, DWConv, [86, 3, 2]], # 23  [80] -> [40] 
    [-1, 1, Conv, [16, 1, 1]], # 24
    [-1, 1, Bottleneck3, [16, 92]], # 25 [batch, 40, size/16, size/16]
    [-1, 1, Bottleneck3, [16, 151]], # 26 [batch, 40, size/16, size/16]
  ]

head: [
    [-1, 1, Conv, [48, 1, 1]], # 27 [40]
    [[-1, -5], 1, Concat, [1]], # 28  [batch, 224, size/16, size/16]  [40]  # to line 40 # changed from -4 to -5

    [-1, 1, Conv, [23, 1, 1]], # 29
    [-1, 1, DWConv, [23, 3, 1]], # 30
    [-1, 1, Conv, [25, 1, 1]], # 31
    [-1, 1, Conv, [18, 1, 1]], # 32   [batch, 18, size/8, size/8] -> [40] ###
    
    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 33   [80]
    [[-1, 12], 1, Concat, [1]],  # 34   [80]  ch = 272      # to line 27  # changed from 11 to 12
    [-1, 1, Conv, [11, 1, 1]], # 35
    [-1, 1, DWConv, [11, 3, 1]], # 36 
    [-1, 1, Conv, [14, 1, 1]], # 37   
    [-1, 1, Conv, [18, 1, 1]], # 38 [batch, 18, 160, 160] -> [80] ###

    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 39 [1, 272, 320, 320] -> [160]
    [[-1, 7], 1, Concat, [1]],  # 40  # to line 21
    [-1, 1, Conv, [10, 1, 1]], # 41   
    [-1, 1, DWConv, [10, 3, 1]], # 42 
    [-1, 1, Conv, [13, 1, 1]], # 43   
    [-1, 1, Conv, [18, 1, 1]], # 44   [batch, 18, 320, 320] -> [160]  ###

    [[44, 38, 32], 1, Detect, [nc, anchors]], 


  ]