nc: 1 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [4, 6, 7, 10, 11, 15]
  - [16, 24, 33, 25, 26, 41]
  - [47, 60, 83, 97, 141, 149]

backbone:
  # [from, number, module, args]
  # args: out_channels, size, stride
  [
    [-1, 1, Conv, [8, 3, 2]],  # 0  [batch, 8, size/2, size/2]
    [-1, 1, DWConv, [8, 3, 1]], # 1 [320]
    [-1, 1, Conv, [4, 1, 1 ]], # 2  [320]
    [-1, 1, Conv, [24, 1, 1]], # 3 [-1, 1, DWConv, [24, 3, 2]] # 4
    [-1, 1, Conv, [6, 1, 1]], # 4
    [-1, 1, Bottleneck3, [6]], # 5

    [-1, 1, Conv, [36, 1, 1]], # 6  
    [-1, 1, DWConv, [36, 3, 2]], # 7  [160]
    [-1, 1, Conv, [8, 1, 1]], # 8
    [-1, 2, Bottleneck3, [8]], # 9
    
    [-1, 1, Conv, [48, 1, 1]], # 10 
    [-1, 1, DWConv, [48, 3, 2]], # 11 [80]
    [-1, 1, Conv, [16, 1, 1]], # 12
    [-1, 3, Bottleneck3, [16]], # 13

    [-1, 1, Conv, [96, 1, 1]], # 14
    [-1, 1, DWConv, [96, 3, 1]], # 15
    [-1, 1, Conv, [24, 1, 1]], # 16
    [-1, 2, Bottleneck3, [24]], # 17

    [-1, 1, Conv, [144, 1, 1]], # 18    [80]
    [-1, 1, DWConv, [144, 3, 2]], # 19  [40]
    [-1, 1, Conv, [40, 1, 1]], # 20
    [-1, 2, Bottleneck3, [40]], # 21 [batch, 40, size/16, size/16]
  ]

head: [
    [-1, 1, Conv, [80, 1, 1]], # 22 
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 23 [1, 80, 80, 80]
    [[-1, -6], 1, Concat, [1]], # 24  [batch, 224, size/8, size/8]

    [-1, 1, Conv, [48, 1, 1]], # 25
    [-1, 1, DWConv, [48, 3, 1]], # 26
    [-1, 1, Conv, [36, 1, 1]], # 27
    [-1, 1, Conv, [18, 1, 1]], # 28   [batch, 18, size/8, size/8]
    
    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 29 
    [[-1, 10], 1, Concat, [1]],  # 30 
    [-1, 1, Conv, [24, 1, 1]], # 31
    [-1, 1, DWConv, [24, 3, 1]], # 32 
    [-1, 1, Conv, [24, 1, 1]], # 33   
    [-1, 1, Conv, [18, 1, 1]], # 34 [batch, 18, 160, 160]

    [-5, 1, nn.Upsample, [None, 2, "nearest"]],  # 35 [1, 272, 320, 320]
    [[-1, 6], 1, Concat, [1]],  # 36  
    [-1, 1, Conv, [18, 1, 1]], # 37   
    [-1, 1, DWConv, [18, 3, 1]], # 38 
    [-1, 1, Conv, [24, 1, 1]], # 39   
    [-1, 1, Conv, [18, 1, 1]], # 40   [batch, 18, 320, 320]

    [[40, 34, 28], 1, Detect, [nc, anchors]], 


  ]